/*
Дана квадратная матрица, проверять квадратность или отсутствие матрицы не требуется
Написать функцию, преобразующую входную квадратную матрицу так, чтобы на ее главной диагонали были 1
Находим в строке 1 и помещаем её на главную диагональ
Порядок остальных чисел в строке не должен меняться
При отсутствии 1 в строке выкидывать эксепшен
При наличии более чем одной 1 в строке смещать первую
Важно получить рабочий код, оптимизация кода не требуется
 
  
Входная матрица
1 2 3 4 5
1 2 3 4 5
5 4 3 2 1
1 2 3 4 5
1 2 3 4 5
  
Выходная матрица
1 2 3 4 5
2 1 3 4 5
5 4 1 3 2
2 3 4 1 5
2 3 4 5 1
*/

const toOneMatrix = (matrix = []) => {
    // писать код тут
    matrix.forEach((item) => {
        console.log(item)
    })
    return matrix
}

console.assert(
    JSON.stringify(toOneMatrix(
        [
            [1, 2, 3, 4, 5],
            [1, 2, 3, 4, 5],
            [1, 2, 3, 4, 5],
            [1, 2, 3, 4, 5],
            [1, 2, 3, 4, 5],
        ]
    )) === JSON.stringify([
        [1, 2, 3, 4, 5],
        [2, 1, 3, 4, 5],
        [2, 3, 1, 4, 5],
        [2, 3, 4, 1, 5],
        [2, 3, 4, 5, 1],
    ])
)

console.assert(
    JSON.stringify(toOneMatrix(
        [
            [2, 3, 4, 5, 1],
            [1, 2, 3, 1, 5],
            [2, 3, 1, 4, 5],
            [1, 2, 5, 4, 3],
            [1, 2, 3, 4, 5],
        ]
    )) === JSON.stringify([
        [1, 2, 3, 4, 5],
        [2, 1, 3, 1, 5],
        [2, 3, 1, 4, 5],
        [2, 5, 4, 1, 3],
        [2, 3, 4, 5, 1],
    ])
)

try {
    console.assert(
        JSON.stringify(toOneMatrix(
            [
                [1, 2, 3, 4, 5],
                [1, 2, 3, 4, 5],
                [2, 2, 3, 4, 5],
                [1, 2, 3, 4, 5],
                [1, 2, 3, 4, 5],
            ]
        )) === JSON.stringify([
            [1, 2, 3, 4, 5],
            [2, 1, 3, 4, 5],
            [2, 3, 1, 4, 5],
            [2, 3, 4, 1, 5],
            [2, 3, 4, 5, 1],
        ])
    )
} catch (e) {
    console.log('no one in line')
}
